Creating DataFrames

In [3]:
import pandas as pd

From Dictionary

In [2]:
data = { "Name":  ['Carl', 'Carol', 'Cas'],
         "Age":   [43,        23,     30],
         "Score": [123,     168,    14]
        }

In [3]:
pd.DataFrame(data)

    Name  Age  Score
0   Carl   43    123
1  Carol   23    168
2    Cas   30     14

From List of Lists

In [1]:
data = [['Carl',    43,     123],
        ['Carol',   23,     160],
        ['Cas',     30,     140]]

In [4]:
df = pd.DataFrame(data)

In [5]:
pd.DataFrame(data, columns=['Name', 'age', 'score'])

    Name  age  score
0   Carl   43    123
1  Carol   23    160
2    Cas   30    140